# Data Loading, Storage and File Formats

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('education.csv')

In [4]:
df

                         Education
0                      High School
1                 Associate Degree
2                Bachelor's Degree
3  Graduate or Professional Degree
4                     Some College
5                            Other
6             Prefer not to answer

In [5]:
df_2 = pd.read_csv('currency.csv')

In [6]:
df_2

    Code Symbol                      Name
0    AED    د.إ    United Arab Emirates d
1    AFN      ؋            Afghan afghani
2    ALL      L              Albanian lek
3    AMD    AMD             Armenian dram
4    ANG      ƒ  Netherlands Antillean gu
..   ...    ...                       ...
158  XOF    CFA    West African CFA franc
159  XPF     Fr                 CFP franc
160  YER      ﷼               Yemeni rial
161  ZAR      R        South African rand
162  ZMW     ZK            Zambian kwacha

[163 rows x 3 columns]

In [8]:
df_2.head()

  Code Symbol                      Name
0  AED    د.إ    United Arab Emirates d
1  AFN      ؋            Afghan afghani
2  ALL      L              Albanian lek
3  AMD    AMD             Armenian dram
4  ANG      ƒ  Netherlands Antillean gu

In [9]:
df_2.tail()

    Code Symbol                    Name
158  XOF    CFA  West African CFA franc
159  XPF     Fr               CFP franc
160  YER      ﷼             Yemeni rial
161  ZAR      R      South African rand
162  ZMW     ZK          Zambian kwacha

In [10]:
!type education.csv

Education
High School
Associate Degree
Bachelor's Degree
Graduate or Professional Degree
Some College
Other
Prefer not to answer

In [12]:
import csv

In [13]:
f = open('education.csv')
reader = csv.reader(f)

In [14]:
reader

In [15]:
print(reader)

<_csv.reader object at 0x0000022D43CE29E0>

In [16]:
for line in reader:
    print(line)

['Education']
['High School']
['Associate Degree']
["Bachelor's Degree"]
['Graduate or Professional Degree']
['Some College']
['Other']
['Prefer not to answer']

In [17]:
f.close()

In [19]:
# reading a file which I just created huh
my_file = pd.read_csv('sample.csv')
my_file

,Name,Subject,Age,City,Country,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,Lucky,Mathematics,20,Vadodara,India,NaN,NaN,NaN,NaN,NaN
1,Ayan,Computer Science,21,Mumbai,India,NaN,NaN,NaN,NaN,NaN
2,Cody,Physics,23,LA,USA,NaN,NaN,NaN,NaN,NaN
3,Darksun,Mathematics,18,Macau,Hong Kong,NaN,NaN,NaN,NaN,NaN
4,Omar,Electrical Engineering,28,Neom,Saudi Arabia,NaN,NaN,NaN,NaN,NaN
5,Osvaldo,Statistics,40,Turin,Italy,NaN,NaN,NaN,NaN,NaN
6,Shubham,Arts,22,Udaipur,India,NaN,NaN,NaN,NaN,NaN
7,Henry,English Literature,54,New York,USA,NaN,NaN,NaN,NaN,NaN
8,Toby,Physics,26,Sydney,Australia,NaN,NaN,NaN,NaN,NaN